{
  "CONTENT": {
    "STEP": "Step",
    "NEXT": "Next",
    "AGAIN": "Anew",
    "GO_PRACTICE": "To practice",
    "HOME_TITLE": "Algebra of predicates",
    "SIMULATOR": "Simulator",
    "DISCIPLINE": "Discipline  \"Mathematical logic\" ",
    "CREATOR": "Perform:",
    "ME": "Kurkin V.V",
    "TEACHER": "Head:",
    "TEACHER_NAME": "Chernenko O.O",
    "ENG_BUTTON": "Continue in English",
    "UA_BUTTON": "Continue in Ukrainian",
    "CHOOSE_LANGUAGE": "Select a language",
    "FIRST_QUESTION": "Let predicate P (x) correspond to the sentence «x ≥ 1». Specify the subject area in which the expression ∃xP (x) is true.",
    "FIRST_QUESTION_ANSWER_FIRST": "The subject area is the set of real numbers",
    "FIRST_QUESTION_ANSWER_SECOND": "The subject area is the set of natural numbers",
    "FIRST_QUESTION_ANSWER_THIRD": "The subject area is the set of integers",
    "FIRST_QUESTION_ANSWER_FOURTH": "All answers are correct",
    "SECOND_QUESTION": "Let predicate P (x) correspond to the sentence «x ≥ 1». Specify the subject area in which the expression ∃xP (x) is true.",
    "SECOND_QUESTION_ANSWER_FIRST": "The subject area is the set of real numbers",
    "SECOND_QUESTION_ANSWER_SECOND": "The subject area is the set of natural numbers",
    "SECOND_QUESTION_ANSWER_THIRD": "The subject area is the set of integers",
    "SECOND_QUESTION_ANSWER_FOURTH": "All answers are correct",
    "THIRD_QUESTION": "Let the predicate P (x) correspond to the sentence «x is a prime number» and give the true statement «There is a prime number». What formula can you write down the sentence?",
    "THIRD_QUESTION_ANSWER_FIRST": "∃xP(x)",
    "THIRD_QUESTION_ANSWER_SECOND": "∀xP(x)",
    "THIRD_QUESTION_ANSWER_THIRD": "∀x∃xP(x)",
    "THIRD_QUESTION_ANSWER_FOURTH": "P(x)",
    "FOURTH_QUESTION": "Let the predicate Q (x) correspond to the sentence «x is a rational number», R (x) correspond to the sentence «x - is a real number» and the true statement «Each rational number is true» is given. What formula can you write down the sentence?",
    "FOURTH_QUESTION_ANSWER_FIRST": "∃x(Q(x)→R(x))",
    "FOURTH_QUESTION_ANSWER_SECOND": "∀x∃x(Q(x)→R(x))",
    "FOURTH_QUESTION_ANSWER_THIRD": "∀x(Q(x)→R(x))",
    "FOURTH_QUESTION_ANSWER_FOURTH": "Q(x)→R(x)",
    "FIFTH_QUESTION": "Let the predicate P (x, y) correspond to the sentence «x is less than y» and the true statement «For every number x there exists a number y such that x < y». What formula can you write down the sentence?",
    "FIFTH_QUESTION_ANSWER_FIRST": "∃yP(x,y)",
    "FIFTH_QUESTION_ANSWER_SECOND": "∀xP(x,y)",
    "FIFTH_QUESTION_ANSWER_THIRD": "∀x∃yP(x,y)",
    "FIFTH_QUESTION_ANSWER_FOURTH": "P(x,y)",
    "SIX_QUESTION": "Give an interpretation of the formula of the algebra of the predicates ∀x (P (x) → Q (x)), where the area of interpretation is the set of living creatures, P (x): x - fish, Q (x): x lives in water",
    "SIX_QUESTION_ANSWER_FIRST": "All fish live in water",
    "SIX_QUESTION_ANSWER_SECOND": "There are fish that live in the water",
    "SIX_QUESTION_ANSWER_THIRD": "Not all fish live in water",
    "SIX_QUESTION_ANSWER_FOURTH": "All fish can live in water",
    "SEVEN_QUESTION": "Give an interpretation of the formula of the algebra of predicates ∃x (P (x) → Q (x)), where the area of interpretation is the set of living creatures, P (x): x is a fish, Q (x): x can live without water",
    "SEVEN_QUESTION_ANSWER_FIRST": "All fish can live without water",
    "SEVEN_QUESTION_ANSWER_SECOND": "There are fish that can live without water",
    "SEVEN_QUESTION_ANSWER_THIRD": "All fish cannot live without water",
    "SEVEN_QUESTION_ANSWER_FOURTH": "All fish can live in water",
    "EIGHT_QUESTION": "Give an interpretation of the formula of the algebra of predicates ∀x (P (x) → Q (x)), where the area of interpretation is the set of living creatures, P (x): x is human, Q (x): x is mortal",
    "EIGHT_QUESTION_ANSWER_FIRST": "All people are immortal",
    "EIGHT_QUESTION_ANSWER_SECOND": "There are mortal people",
    "EIGHT_QUESTION_ANSWER_THIRD": "Not all people are mortal",
    "EIGHT_QUESTION_ANSWER_FOURTH": "All people are mortal",
    "NINE_QUESTION": "Give an interpretation of the formula of the algebra of predicates ∀x (P (x) → Q (x)), where the area of interpretation is the set of integers, P (x): x is divisible by 6, Q (x): x is divisible by 3",
    "NINE_QUESTION_ANSWER_FIRST": "All numbers divisible by 6 are divisible by 3",
    "NINE_QUESTION_ANSWER_SECOND": "There are numbers that divide by 3 if divisible by 6",
    "NINE_QUESTION_ANSWER_THIRD": "All numbers that are divisible by 3 are divisible by 6",
    "NINE_QUESTION_ANSWER_FOURTH": "Not all numbers divisible by 6 are divisible by 3",
    "TEN_QUESTION": "Give an interpretation of the formula of the algebra of predicates ∃x (P (x) → Q (x)), where the area of interpretation is the set of integers, P (x): x is divisible by 6, Q (x): x is divisible by 3",
    "TEN_QUESTION_ANSWER_FIRST": "Всі числа, які діляться на 6, діляться на 3",
    "TEN_QUESTION_ANSWER_SECOND": "There are numbers that divide by 3 if divisible by 6",
    "TEN_QUESTION_ANSWER_THIRD": "All numbers that are divisible by 3 are divisible by 6",
    "TEN_QUESTION_ANSWER_FOURTH": "There are numbers that divide by 6 if divisible by 3",
    "ELEVEN_QUESTION": "Record the sentence \"Each student in the group has studied discrete mathematics\" using predicates and quantifiers. First, rewrite the sentences so that it is clear how best to place the quantifiers",
    "ELEVEN_QUESTION_ANSWER_FIRST": "Every student is aware that this student has studied discrete mathematics",
    "ELEVEN_QUESTION_ANSWER_SECOND": "Every student in the group is aware that this student has studied",
    "ELEVEN_QUESTION_ANSWER_THIRD": "The student in the group is known to have studied discrete mathematics",
    "ELEVEN_QUESTION_ANSWER_FOURTH": "Every student in the group is aware that this student has studied discrete mathematics",
    "TWELVE_QUESTION": "Record the sentence \"Each student in the group has studied discrete mathematics\" using predicates and quantifiers. Let us rewrite the sentence so that it is clear how best to place the quantifiers: \"Every student in the group is aware that this student has studied a discrete mathematician.\" Now we introduce the variable x, and the sentence looks like:",
    "TWELVE_QUESTION_ANSWER_FIRST": "The student of the x group is known to have x studied discrete mathematics",
    "TWELVE_QUESTION_ANSWER_SECOND": "Every student in the x group is known to have x studied discrete mathematics",
    "TWELVE_QUESTION_ANSWER_THIRD": "Every student in the group is known to have x studied discrete mathematics",
    "TWELVE_QUESTION_ANSWER_FOURTH": "Each student in the group is known to have studied discrete mathematics",
    "THIRTEEN_QUESTION": "Record the sentence \"Each student in the group has studied discrete mathematics\" using predicates and quantifiers. Let us rewrite the sentence so that it is clear how best to place the quantifiers: \"Every student in the group is aware that this student has studied a discrete mathematician.\" Now we introduce the variable x, and the sentence takes the form: \"Every student in the x group knows that x has studied discrete mathematics.\" Let us introduce the predicate C (x):",
    "THIRTEEN_QUESTION_ANSWER_FIRST": "x studied discrete mathematics",
    "THIRTEEN_QUESTION_ANSWER_SECOND": "x - student of the group",
    "THIRTEEN_QUESTION_ANSWER_THIRD": "student studied x",
    "THIRTEEN_QUESTION_ANSWER_FOURTH": "studied discrete mathematics",
    "FOURTEEN_QUESTION": "Record the sentence \"Each student in the group has studied discrete mathematics\" using predicates and quantifiers. Let us rewrite the sentence so that it is clear how best to place the quantifiers: \"Every student in the group is aware that this student has studied a discrete mathematician.\" Now we introduce the variable x, and the sentence takes the form: \"Every student in the x group knows that x has studied discrete mathematics.\" We introduce the predicate C (x): \"x studied discrete mathematics.\" If the domain of variable x is all students of the group, then you can write the given sentence as",
    "FOURTEEN_QUESTION_ANSWER_FIRST": "∃xC(x)",
    "FOURTEEN_QUESTION_ANSWER_SECOND": "∀xP(x)",
    "FOURTEEN_QUESTION_ANSWER_THIRD": "∀xС(x)",
    "FOURTEEN_QUESTION_ANSWER_FOURTH": "∀x∃xC(x)",
    "FIFTEEN_QUESTION": "Record the sentence \"Each student in the group has studied discrete mathematics\" using predicates and quantifiers. Let us rewrite the sentence so that it is clear how best to place the quantifiers: \"Every student in the group is aware that this student has studied a discrete mathematician.\" Now we introduce the variable x, and the sentence takes the form: \"Every student in the x group knows that x has studied discrete mathematics.\" We introduce the predicate C (x): \"x studied discrete mathematics\". It should be assumed that we are interested in other pear people, except those who study in one academic group. Taking the subject area of all people, you can write down a given sentence as follows:",
    "FIFTEEN_QUESTION_ANSWER_FIRST": "For each person, if that person is a student of the group, then x has studied discrete mathematics",
    "FIFTEEN_QUESTION_ANSWER_SECOND": "For each person x, if that person is a student of the group, then x studied discrete mathematics",
    "FIFTEEN_QUESTION_ANSWER_THIRD": "For each person x, if that person is a student of the group, then x studied discrete mathematics",
    "FIFTEEN_QUESTION_ANSWER_FOURTH": "For each person x, if that person x is a student of the group, then he studied discrete mathematics",
    "SIXTEEN_QUESTION": "Record the sentence \"Each student in the group has studied discrete mathematics\" using predicates and quantifiers. Let us rewrite the sentence so that it is clear how best to place the quantifiers: \"Every student in the group is aware that this student has studied a discrete mathematician.\"Now we introduce the variable x, and the sentence looks like: \"Every student in x group knows that x has studied discrete mathematics.\" We introduce the predicate C (x): \"x studied discrete mathematics\". It should be assumed that we are interested in other pear people, except those who study in one academic group. Taking the subject area of all people, you can write down a given sentence like this: \"For each person x, if that person is a student of the group, then x studied discrete mathematics.\" Determine the predicate S (x)",
    "SIXTEEN_QUESTION_ANSWER_FIRST": "The person is studying in a group",
    "SIXTEEN_QUESTION_ANSWER_SECOND": "Person x studied discrete mathematics",
    "SIXTEEN_QUESTION_ANSWER_THIRD": "The person in is studying in a group",
    "SIXTEEN_QUESTION_ANSWER_FOURTH": "Person x learns in a group",
    "SEVENTEEN_QUESTION": "Record the sentence \"Each student in the group has studied discrete mathematics\" using predicates and quantifiers. Let us rewrite the sentence so that it is clear how best to place the quantifiers: \"Every student in the group is aware that this student has studied a discrete mathematician.\"Now we introduce the variable x, and the sentence looks like: \"Every student in x group knows that x has studied discrete mathematics.\" We introduce the predicate C (x): \"x studied discrete mathematics\". It should be assumed that we are interested in other pear people, except those who study in one academic group. Taking the subject area of all people, you can write down a given sentence like this: \"For each person x, if that person is a student of the group, then x studied discrete mathematics.\" If the predicate S (x) has the form \"Person x learns in a group\", then the given sentence should be written in the form",
    "SEVENTEEN_QUESTION_ANSWER_FIRST": "∃x(S(x)→C(x))",
    "SEVENTEEN_QUESTION_ANSWER_SECOND": "∀x(S(x)→C(x))",
    "SEVENTEEN_QUESTION_ANSWER_THIRD": "∀x∃x(S(x)→C(x))",
    "SEVENTEEN_QUESTION_ANSWER_FOURTH": "∀x(S(x)∧C(x))",
    "EIGHTEEN_QUESTION": "If the predicate S (x) has the form \"Person x learns in a group\", then the given sentence should be written in the form. Note that a given sentence cannot be written as, because then it would mean:",
    "EIGHTEEN_QUESTION_ANSWER_FIRST": "All individuals in the subject area study in the group and study discrete mathematics",
    "EIGHTEEN_QUESTION_ANSWER_SECOND": "There are people in the subject area who study in a group and study discrete mathematics",
    "EIGHTEEN_QUESTION_ANSWER_THIRD": "All subjects in the subject area study in the group and have not studied discrete mathematics",
    "EIGHTEEN_QUESTION_ANSWER_FOURTH": "All subjects in the subject area do not study in the group, but have studied discrete mathematics",
    "NINETEEN_QUESTION": "If you enter the double predicate Q (x, y): \"Student x learns discipline y\", then you can replace",
    "NINETEEN_QUESTION_ANSWER_FIRST": "S(х) on Q(x, Discrete Math)",
    "NINETEEN_QUESTION_ANSWER_SECOND": "С(х) on Q(y, Discrete Math)",
    "NINETEEN_QUESTION_ANSWER_THIRD": "С(х) on Q( Discrete Math, x)",
    "NINETEEN_QUESTION_ANSWER_FOURTH": "С(х) on Q(x, Discrete Math)",
    "TWENTY_QUESTION": "If you enter a double predicate Q (x, y): \"Student x is studying discipline in\", then you can replace C (x) with Q (x, Discrete_ mathematics), which will allow us to rewrite the formula ∀xC (x) in the form:",
    "TWENTY_QUESTION_ANSWER_FIRST": "∀xQ(x, Discrete Math)",
    "TWENTY_QUESTION_ANSWER_SECOND": "∀x(S(x)→C(x, Discrete Math))",
    "TWENTY_QUESTION_ANSWER_THIRD": "∀x(S(x)→Q(x, Discrete Math))",
    "TWENTY_QUESTION_ANSWER_FOURTH": "∀xC(x, Discrete Math)",
    "TWENTY_ONE_QUESTION": "If you enter a double predicate Q (x, y): \"Student x is studying discipline in\", then you can replace C (x) with Q (x, Discrete_ mathematics), which will allow us to rewrite the formula ∀x (S (x) → C (x )) as:",
    "TWENTY_ONE__QUESTION_ANSWER_FIRST": "∀xQ(x, Discrete Math)",
    "TWENTY_ONE__QUESTION_ANSWER_SECOND": "∀x(S(x)→C(x, Discrete Math))",
    "TWENTY_ONE__QUESTION_ANSWER_THIRD": "∀x(S(x)→Q(x, Discrete Math))",
    "TWENTY_ONE__QUESTION_ANSWER_FOURTH": "∀xC(x, Discrete Math)",
    "THEORY_BUTTON": "Review the theory",
    "BACK": "Back",
    "FIRST_PARAGRAPH": "Predicate logic is a section of classical symbolic logic that studies the subject-predicate structure of expressions, on the basis of which they determine the meaning of the truth of expressions; in another, it is a deductive theory that models the process of deriving one utterance from another, taking into account their structure. Predicate logic is interpreted as an extension of the logic of utterances through the discovery of the internal structure of utterances and the introduction of new terms and systems of axioms. The logic of predicates as a system is created in accordance with the general principles of constructing formal systems. The peculiarity of predicate logic is that it is more complex in terms of semantics and syntax than the logic of utterances. The semantics and syntax of predicate logic are distinguished. In the semantic aspect, the subject-predicate structure of utterances at the substantive level is determined. This allows us to identify properties inherent in a specific set of empirical or abstract objects, and to enter terms that separate the scope of the predicates: utterance, property, relation, predicate, single predicate, multifaceted predicate, quantifier of generality, quantifier of existence, true meaning of expression. The statement in which an empirical or abstract object is attributed to a property P or the relationship between objects is defined, gives two values ​​of truth: \"truth\" (i); \"False\" (x). Accordingly, the predicate logic is ambiguous in the number of truth values ​​of statements.",
    "SECOND_PARAGRAPH": "In the syntactic aspect, the subject-predicate structure of utterances is determined in the process of abstracting from their content and formalized by means of artificially created language, on the basis of which they perform logical operations on symbols depicting these relations (number predicates). The structure of predicate logic is the alphabet, rules for constructing formulas from symbols of the alphabet, rules for deductive inference with axioms of new formulas (proving theorems), rules for interpretation. Predicate logic language is a system of characters that create the alphabet. It includes characters typed in expression logic and new characters that denote terms entered in predicate logic",
    "ABC": "ABC:",
    "FIRST_LIST_ITEM": "small Latin letters, with or without indexes, which are called predicate variables or terms;",
    "SECOND_LIST_ITEM": "uppercase Latin letters, with or without indexes, which are called expressed variables;",
    "THIRD_LIST_ITEM": "Pn (x1, ..., xn), Qn (x1, ..., xn) predicate variables;",
    "FOURTH_LIST_ITEM": "symbols of logical operations ¬, ∧, ∨, →;",
    "FIFTH_LIST_ITEM": "the quantizer symbols рів, ∀;",
    "SIXTH_LIST_ITEM": "technical characters: (- left bracket;) - right bracket.",
    "THIRD_PARAGRAPH": "A predicate (n-place or n-ary) is a function with a range of values {0,1} (or \"Truth\" and \"False\") defined on the nth Cartesian degree of the set M. Thus, every n-ku He characterizes the elements of M as either \"true\" or \"false\".",
    "FOURTH_PARAGRAPH": "By the n-place predicate P (x1, ..., xn) we will understand some logical function of n variables x1, ..., xn, which is defined by the set Ω and takes the value true or false.",
    "FIFTH_PARAGRAPH": "The predicate definition area is the set Ω on which the predicate is defined.",
    "SIXTH_PARAGRAPH": "The quotient of generality denotes an expression in which property P is attributed to a certain nonempty class in general, which means that property of R. is inherent in all elements of class A. \"Whatever it is\"). It is denoted by the symbol ∀, and the complete formula is (read each property has the property P). Thus, the expression \"For all individuals in the class of people, the inherent property of\" being mortal \"(\" All people are mortal \") is represented by the formula ∀xP (x).",
    "SEVEN_PARAGRAPH": "The quantifier of existence denotes the statement of a certain nonempty class, in which the property P is inherent only in some elements of that class, that is, there are elements of the class A to which the property R.",
    "EIGHT_PARAGRAPH": "The quantifier of existence has the expression \"exist\" (\"some\", \"only one\"). It is denoted by the symbol ∃ and the complete formula is ∃xP (x) (read \"exists\" x, which has the property P). For example, the statements \"There are people who have the inherent property of writing poems\" (\"Some people write poems\") are represented by the formula ∃xP (x).",
    "NINE_PARAGRAPH": "The quantifiers of generality and existence are interdependent, which is why all logical operations are performed by defining logical relationships over them.",
    "TEN_PARAGRAPH": "Construction of formulas of logic of predicates:",
    "SEVEN_LIST_ITEM": "A particular predicate is called an elementary formula.",
    "EIGHT_LIST_ITEM": "If F and Q are formulas of predicate logic, then ¬ F, (F ∧ Q), (F ∨ Q), (F → Q) are formulas.",
    "NINE_LIST_ITEM": "P (x) is a formula expressing a property (single predicate).",
    "TEN_LIST_ITEM": "R (x, y) is a formula that expresses a double predicate.",
    "ELEVEN_LIST_ITEM": "R (x, y, z) is a formula that expresses a triple predicate.",
    "TWELVE_LIST_ITEM": "If P is a formula and x is a subject variable, then ∀x P (x) and ∃x P (x) are formulas.",
    "ELEVEN_PARAGRAPH": "The quantifier scope means the expression to which the quantifier belongs. UDCs are restricted by brackets to the left and right of the expression. The left bracket marks the beginning of the scope, and the right bracket marks the end. Within the ODC, the bound and free variables are separated. The variable immediately following the quantizer is called a sub-quantum variable, and the formula to which the quantifier belongs is a sub-quantum formula, or the scope of a quantizer. Associated variable - A variable that falls within the scope of the quantifiers of a community ∀ or existence ∃ or both at once. For example, in the formulas ∀x P (x), ∃x P (x) the related variable is x.",
    "TWELVE_PARAGRAPH": "A free variable is included in a certain formula but does not fall within the scope of quantifiers of generality ∀ or existence ∃ unlike a bound variable. Thus, in the formula ∀ (P (x)) → Q (x) - the variable x is related in the same way as in the formula ∀x P (x), but is free in the expression Q (x).",
    "THIRTEEN_PARAGRAPH": "In predicate logic, a quantifier of generality is treated as a generalization of conjunction, and a quantifier of existence as a generalization of a disjunction if the set M of variables x is finite, that is, it consists of a finite number of objects.",
    "FOURTEEN_PARAGRAPH": "Quantification - the determination of the subject's volume and predicate in the structure of expression by quantum terms - \"all\" (\"any\", \"each\") and \"some\"; logical operation by which to determine the scope of quantifiers. This is a transition from the formula of the form P (x) to the formula of the form ∃x (P (x)) or Their (P (x)), which causes the variable x in the formula P (x) to cease to be simply a symbol and express a certain property, The class x variable A. In the formula P (x) is called a free variable, and after quantification it is called a bound variable, that is, in the formulas ∃x (P (x)) and Their (P (x)) variable x becomes a bond ' stubborn. The quantification of expressions take the form: P (x, y) is a double-valued predicate defined on the set M. The generality quantifier and the existence quantifier can be used for both the variable x and the variable y. The variable to which the quantifier is used becomes bound, and the second variable becomes free.",
    "FIFTEEN_PARAGRAPH": "By means of quantification (using a quantifier for one of the variables), the double predicate can be converted to single and the triple predicate to double. The value of the truth of statements with the quantifiers of generality and existence. The logic of predicates is ambiguous in the number of values ​​of truth, so statements with the quantifiers of generality and existence give two values ​​of truth - \"and\", \"x\". To determine the truth of expressions with quantifiers of generality or existence, set a set M with a certain number of elements for which the predicate is true. The truth values ​​are determined using the truth table.",
    "SIXTEEN_PARAGRAPH": "By means of quantification (using a quantifier for one of the variables), the double predicate can be converted to single and the triple predicate to double. The value of the truth of statements with the quantifiers of generality and existence. The logic of predicates is ambiguous in the number of values ​​of truth, so statements with the quantifiers of generality and existence give two values ​​of truth - \"and\", \"x\". To determine the truth of expressions with quantifiers of generality or existence, set a set M with a certain number of elements for which the predicate is true. The truth values ​​are determined using the truth table.",
    "SEVENTEEN_PARAGRAPH": "First-order logic languages are constructed on the basis of: the set of functional characters F and the set of predicate characters P. Arity (number of matches) is associated with each functional and predicate symbol. In addition, additional characters are used:",
    "THIRTEEN_LIST_ITEM": "Symbols of variables;",
    "FOURTEEN_LIST_ITEM": "Proposals: ∨, ∧, ¬, →;",
    "FIFTEEN_LIST_ITEM": "Quantifiers: generality ∀ and existence ∃;",
    "SIXTEEN_LIST_ITEM": "Service symbols: parentheses and commas.",
    "EIGHTEEN_PARAGRAPH": "These characters, together with the characters in P and F, form the first-order logic alphabet.",
    "NINETEEN_PARAGRAPH": "Examples of algebra of predicates",
    "TWENTY_PARAGRAPH": "Example 1.",
    "TWENTY_ONE_PARAGRAPH": "Give examples of interpretations of the formula of the algebra of the predicates Their (P (x)) → Q (x)).",
    "TWENTY_TWO_PARAGRAPH": "Decoupling.",
    "EIGHTEEN_LIST_ITEM": "Area of interpretation is the set of living things, P (x): x is a fish, Q (x): x lives in water. Interpretation of the formula: \"All fish live in water.\"",
    "NINETEEN_LIST_ITEM": "Area of interpretation is the set of living beings, P (x): x is human, Q (x): x is mortal. The interpretation of the formula: \"All men are mortal.\"",
    "TWENTY_LIST_ITEM": "Area of interpretation is the set of integers, P (x): x is divisible by 6, Q (x): x is divisible by 3. The interpretation of the formula: \"All numbers divisible by 6 are divisible by 3\".",
    "TWENTY_THREE_PARAGRAPH": "Example 2.",
    "TWENTY_FOUR_PARAGRAPH": "Let the predicate P (x) correspond to the sentence \"x ≥ 1\" and let the domain consist of all real numbers. Then their statement (P (x) is false: Their (P (x) = F.",
    "TWENTY_FIVE_PARAGRAPH": "If the subject domain consists of all positive integers, then their statement (P (x)) is true: Their (P (x) = T.",
    "TWENTY_SIX_PARAGRAPH": "Example 3.",
    "TWENTY_SEVEN_PARAGRAPH": "We denote the sentence \"x is a prime number\" as P (x), \"x is a rational number\" as Q (x), \"x is a real number\" as R (x) and \"x is less than y\" as LESS (x, in). Consider these true statements.",
    "TWENTY_ONE_LIST_ITEM": "Every rational number is valid.",
    "TWENTY_TWO_LIST_ITEM": "There is a prime number.",
    "TWENTY_THREE_LIST_ITEM": "For every number x there is a number y such that x <y.",
    "TWENTY_EIGHT_PARAGRAPH": "These sentences can be written using the following formulas.",
    "TWENTY_FOUR_LIST_ITEM": "Their (P (x)) → Q (x))",
    "TWENTY_FIVE_LIST_ITEM": "∃x(P(x)",
    "TWENTY_SIX_LIST_ITEM": "∀х∃yLESS(x,y).",
    "TWENTY_NINE_PARAGRAPH": "Example 4.",
    "THIRTIETH_PARAGRAPH": "We write down the sentence \"Each student of the group studied discrete mathematics\" with the help of predicates and quantifiers.",
    "THIRTIETH_ONE_PARAGRAPH": "First, rewrite the sentence so that it is clear how best to place the quantifiers: \"Every student in the group knows that this student has studied a discrete mathematician.\"",
    "THIRTIETH_TWO_PARAGRAPH": "First, rewrite the sentence so that it is clear how best to place the quantifiers: \"Every student in the group knows that this student has studied a discrete mathematician.\"",
    "THIRTIETH_THREE_PARAGRAPH": "We introduce the predicate C (x): \"x studied discrete mathematics.\" If the domain of variable x is all students of the group, then you can write the given sentence as CxC (x).",
    "THIRTIETH_FOURTH_PARAGRAPH": "There are other correct representations with different subject areas and predicates. In particular, we can assume that we are interested in other pears other than those who study in one academic group.",
    "THIRTIETH_FIVE_PARAGRAPH": "Taking as a subject area of all people, you can write down a given sentence like this: \"For each person x, if that person is a student of a group, then x studied discrete mathematics.\"",
    "THIRTIETH_SIX_PARAGRAPH": "If the predicate S (x) has the form \"Person x learns in a group\", then the given sentence should be written in the form SxS (x) → C (x)). Note that a given sentence cannot be written as SxS (x) ∧C (x)), because then it would mean that all subjects in the subject area study in the group and study discrete mathematics.",
    "THIRTIETH_SEVEN_PARAGRAPH": "Another way to write down a given sentence is to enter a double predicate Q (x, y): \"Student x is learning discipline y\". Then you can replace C (x) with Q (x, Discrete_Mathematics), which will allow you to rewrite the given formulas in the form ∀xQ (x, Discrete_Mathematics)) or SxS (x) ∧Q (x, Discrete_Mathematics))",
    "LAST_PAGE_MESSAGE": "Congratulations, you've completed the simulator.",
    "NO_ANSWER": "You must choose the answer"
  }
}
